examples/render_all_grammars/dot/tests_functional_test_metamodel_import_diamond_third.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


40685640[ label="{Third|}"]

40213400[ label="{ID|}"]

40234056[ label="{STRING|}"]

40246184[ label="{BOOL|}"]

40341704[ label="{INT|}"]

40269992[ label="{FLOAT|}"]

40275912[ label="{STRICTFLOAT|}"]

40281448[ label="{NUMBER|}"]

40286984[ label="{BASETYPE|}"]

40671912[ label="{*OBJECT|}"]

40677448[ label="{MyDiamondRule|+a:INT\l}"]



40685640 -> 40677448[arrowtail=diamond, dir=both, headlabel="diamond "]
40281448 -> 40275912 [dir=back]
40281448 -> 40341704 [dir=back]
40286984 -> 40281448 [dir=back]
40286984 -> 40269992 [dir=back]
40286984 -> 40246184 [dir=back]
40286984 -> 40213400 [dir=back]
40286984 -> 40234056 [dir=back]
40671912 -> 40286984 [dir=back]

}
